app/views/groups/add_user.erb

SELECT "groups".* FROM "groups"
---
   Group
   <%= f.select :group_id, options_for_select(Group.all.map {|p| [p.name,p.id]}) %>

SELECT "users".* FROM "users"
---
 	User
   <%= f.select :user_id, options_for_select(User.all.map {|p| [p.name,p.id]}) %>