app/views/groups/add_wallpaper.html.erb

SELECT "groups".* FROM "groups"
---
 <p>
   <%= f.select :group_id, options_for_select(Group.all.map {|p| [p.name,p.id]}) %>