app/views/groups/new.html.erb

SELECT "users".* FROM "users"
---
 <p>
   <%= f.select :user_id, options_for_select(User.all.map {|p| [p.name,p.id]}) %>