wallpaper/app/controllers/groups_controller.rb

INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 09 Jun 2014 13:09:05 UTC +00:00], ["name", "asd"], ["updated_at", Mon, 09 Jun 2014 13:09:05 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "memberships" ("administrator", "created_at", "group_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["administrator", true], ["created_at", Wed, 11 Jun 2014 08:58:52 UTC +00:00], ["group_id", 5], ["status", 1], ["updated_at", Wed, 11 Jun 2014 08:58:52 UTC +00:00], ["user_id", 18]]
---
  def create

         logger.info "********************************************************create_params**#{group_params.inspect}*************************************"


     #check if group exists
     # if Group.where(:name => group_params[:name]).first != nil
     #    render :json => {:status => RESPONSE_ERROR_GROUP_ALREADY_EXISTS ,:message => "Error"}
     #    return
     # end

     @group = Group.new(:name=>group_params[:name])
     @group.save

  	 @user = User.find(group_params[:user_id])

     @membership = Membership.new(:user => @user , :group => @group, :administrator => true , :status => 1)
     @membership.save

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "memberships"."group_id" = "groups"."id" INNER JOIN "memberships" "memberships_groups_join" ON "memberships_groups_join"."group_id" = "groups"."id" INNER JOIN "users" ON "users"."id" = "memberships_groups_join"."user_id" WHERE "groups"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 10]]
SELECT "users".*, "t0"."group_id" AS ar_association_key_name FROM "users" INNER JOIN "users_groups" "t0" ON "users"."id" = "t0"."user_id" WHERE "t0"."group_id" IN (1)
SELECT "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."group_id" IN (18)
---
  def show
  	@group = Group.includes([{:wallpapers => :user},{:memberships => :user},:recommendations,{:events => :user}]).find(params[:id])

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "memberships"."group_id" = "groups"."id" INNER JOIN "users" ON "users"."id" = "memberships"."user_id" WHERE (memberships.user_id)
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = ?  [["group_id", 18]]
SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = ?  [["group_id", 18]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (18, 19, 20)
SELECT "users".* FROM "users" WHERE "users"."id" IN (23, 24)
---
   def groups_by_user

      @groups_temp = Group.all(:include => {:memberships => :user}, :conditions => ['users.id=?', params[:id]])
      @groups = Group.includes([{:wallpapers=> :user},{:memberships => :user},:recommendations,{:events => :user}]).where(:id => @groups_temp.map{|group| group.id})

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "11"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "memberships" ("administrator", "created_at", "group_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["administrator", false], ["created_at", Thu, 19 Jun 2014 09:02:55 UTC +00:00], ["group_id", 11], ["status", 1], ["updated_at", Thu, 19 Jun 2014 09:02:55 UTC +00:00], ["user_id", 21]]
---
  def save_user

    @user = User.find(group_user_params[:id])
    @group = Group.includes([:recommendations,:events]).find(group_user_params[:group_id])

    @membership = Membership.new(:user => @user , :group => @group, :administrator => false , :status => 1)
    @membership.save

INSERT INTO "wallpapers" ("created_at", "group_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 23 Jun 2014 12:06:55 UTC +00:00], ["group_id", 18], ["updated_at", Mon, 23 Jun 2014 12:06:55 UTC +00:00]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "18"]]
---
  def save_wallpaper
     @wallpaper = Wallpaper.new(wallpaper_params)
     @wallpaper.timeSec =  Time.now.to_i
     @wallpaper.save

     @group = Group.includes([:wallpapers,:memberships => :user]).find(wallpaper_params[:group_id])