wallpaper/app/controllers/users_controller.rb

INSERT INTO "users" ("countryCode", "created_at", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["countryCode", "972"], ["created_at", Sun, 06 Apr 2014 15:57:46 UTC +00:00], ["name", "yoyo"], ["phone", "050666555"], ["updated_at", Sun, 06 Apr 2014 15:57:46 UTC +00:00]]
---
  def create

     phone = get_phone_number(user_params[:phone],user_params[:countryCode])
     @user = User.where(:phone => phone).first
     if @user == nil
        @user = User.new(user_params)
        @user.phone = phone
     end

     @user.code = random_number
     @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "registrationId" = ? WHERE "users"."id" = 23
---
  def register
      @user = User.find(register_params[:id])
      @user.update_attributes :registrationId => register_params[:registrationId]